tap "stripe/stripe-cli"

# Shell / Terminal
brew "starship"
brew "z"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "direnv"

# Git / GitHub
brew "git"
brew "git-lfs"
brew "gh"
brew "ghq"

# Languages / Runtime
brew "asdf"
brew "mise"
brew "deno"
brew "rustup"
brew "cocoapods"
brew "openjdk"
brew "uv"

# DB
brew "mysql"
brew "postgresql@16", restart_service: :changed, link: true
brew "redis", restart_service: :changed
brew "libpq"

# AWS / Cloud
brew "awscli"
brew "aws-vault"
brew "sops"
brew "prowler"

# Dev tools
brew "act"
brew "watchman"
brew "overmind"
brew "stripe/stripe-cli/stripe"
brew "repomix"

# AI
brew "gemini-cli"

# CLI utilities
brew "jq"
brew "csvlens"
brew "peco"
brew "coreutils"
brew "curl"
brew "watch"
brew "nmap"
brew "wrk"

# Image / File processing
brew "imagemagick"
brew "ghostscript"
brew "libmagic"
brew "libraw"

# Security
brew "gnupg"
brew "libfido2"

# Cask
cask "android-platform-tools"
cask "claude-code"
cask "codex"
cask "ghostty"
cask "gcloud-cli"
cask "kiro-cli"
cask "orbstack"

# VS Code extensions
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "antfu.goto-alias"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-database-client2"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "nuxt.mdc"
vscode "nuxtr.nuxt-vscode-extentions"
vscode "nuxtr.nuxtr-vscode"
vscode "saoudrizwan.claude-dev"
vscode "unifiedjs.vscode-mdx"
vscode "vue.volar"
